Repository: szymonfelinski/BR-practise-group-project
Catalog: ComauRacer3demo/Logical/mappView/Resources/Texts/ControlPageTexts.tmx
Source language: en
Languages: pl

source: Jerk
pl: Zryw

source: Max acceleration
pl: Maksymalne przyspieszenie

source: Max decceleration
pl: Maksymalne opóźnienie

source: Tool control
pl: Przełącz narzędzie

source: Return to zero
pl: Pozycja zero

source: Set velocity of movement
pl: Ustaw prędkość poruszania

source: Semi-auto control
pl: Sterowanie półautomatyczne

source: Auto control
pl: Sterowanie automatyczne

source: Manual control
pl: Sterowanie ręczne

source: Controling with tip coordinates
pl: Sterowanie za pomocą współrzędnych końcówki

source: Controling with indyidual axes coordinates
pl: Sterowanie za pomocą współrzednych poszczególnych osi

source: Calibration
pl: Kalibracja

source: Save axis
pl: Zapisz oś

source: Select axis to be calibrated
pl: Wybierz oś do kalibracji

source: Power ON
pl: Włącz zasilanie

source: Set jerk
pl: Ustaw zryw

source: Set deceleration
pl: Ustaw zwolnienie

source: Set acceleration
pl: Ustaw przyśpieszenie

source: Set velocity
pl: Ustaw prędkość

source: Error reset
pl: Wyłącz tryb błędu

source: Restore Axis 5
pl: Przywróć oś 5

source: Click "Restore Axis 5"
pl: Naciśnij przycisk "Przywróć oś 5"

source: Set axis 6 accordingly to the image and click save
pl: Ustaw oś 6 zgodnie z rysunkiem i zapisz

source: Set axis 5 accordingly to the image and click save
pl: Ustaw oś 5 zgodnie z rysunkiem i zapisz

source: Set axis 4 accordingly to the image and click save
pl: Ustaw oś 4 zgodnie z rysunkiem i zapisz

source: Set axis 3 accordingly to the image and click save
pl: Ustaw oś 3 zgodnie z rysunkiem i zapisz

source: Set axis 2 accordingly to the image and click save
pl: Ustaw oś 2 zgodnie z rysunkiem i zapisz

source: Set axis 1 accordingly to the image and click save
pl: Ustaw oś 1 zgodnie z rysunkiem i zapisz

source: Racer 3 has been calibrated
pl: Racer 3 skalibrowany

source: Calibrate again (after restart)
pl: Skalibruj ponownie (po restarcie)

source: Select axis, set accordingly to image, save and proceed with next axis. You have t set axis 1-5 before you try to set axis 6.
pl: Wybierz oś, ustaw zgodnie z rysunkiem, zapisz i przejdź do następnej osi. Musisz ustawić osie 1-5 zanim przejdziesz do osi 6.

source: Initialization
pl: Inicjalizacja

source: Power
pl: Zasilanie

source: Error
pl: Błąd

source: Manual
pl: Tryb ręczny

source: SemiAuto
pl: Tryb półautomatyczny

source: Auto
pl: Tryb automatyczny

source: Homing
pl: Bazowanie

source: Ready
pl: Tryb gotowości

source: Current State:
pl: Obecny stan:

source: Max velocity
pl: Maksymalna prędkość
